In [1]:
import numpy as np

from pandas import Series,DataFrame

import pandas as pd

In [3]:
ser1 = Series(np.arange(3))

ser1

0    0
1    1
2    2
dtype: int64

In [5]:
ser1 = Series(np.arange(3),index=['A','B','C'])

ser1

A    0
B    1
C    2
dtype: int64

In [6]:
#With a DataFrame we can drop values from either axis
ser1.drop('B')

A    0
C    2
dtype: int64

In [8]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NYC'],columns=['pop','size','year'])

dframe1

     pop  size  year
SF     0     1     2
LA     3     4     5
NYC    6     7     8

In [12]:
# Dropping a row does not permanently alter your array.

dframe1.drop('LA')

     pop  size  year
SF     0     1     2
NYC    6     7     8

In [13]:
dframe1

     pop  size  year
SF     0     1     2
LA     3     4     5
NYC    6     7     8

In [15]:
# We need to specify that axis is 1, not 0
# Axis 0 is our rows, axis 1 is our columns.

dframe1.drop('year',axis=1)

     pop  size
SF     0     1
LA     3     4
NYC    6     7